             PGM
        /*--------------------------------------*/
        /* 変数定義                           */
        /*--------------------------------------*/
             DCL        VAR(&X00     ) TYPE(*CHAR) LEN(001) VALUE(X'00')       /*Ｎｕｌｌ       */
             DCL        VAR(&CMD     ) TYPE(*CHAR) LEN(256)                    /*コマンド       */
             DCL        VAR(&P01     ) TYPE(*CHAR) LEN(064)                    /*引数０１       */
             DCL        VAR(&P02     ) TYPE(*CHAR) LEN(064)                    /*引数０２       */

             /*変数設定*/
             CHGVAR VAR(&P01   )  VALUE(+
                                        '5'+
                                         || &X00 +
                                        )

             CHGVAR VAR(&P02   )  VALUE(+
                                        '/tmp/ushiday@hack-82.json' +
                                         || &X00 +
                                       )

             CHGVAR VAR(&CMD   )  VALUE(+
                                        '/home/ushiday/src/ushiday@hack/iMag_202303-008+
                                         /sample.sh' +
                                         || &X00 +
                                       )


             /*環境変数設定*/
             CALL PGM(QP2SHELL  ) PARM(        +
                   &CMD                        +
                   &P01                        +
                   &P02                        +
             )


             RETURN

     ENDPGM

